//
//  StationInfos.swift
//  鐵路時刻表
//
//  Created by 黃暉德 on 2019/1/9.
//  Copyright © 2019 黃暉德. All rights reserved.
//

import Foundation

struct StationInfo: Codable {
    var id: Int?
    var name: String?
}

let TaipeiPart = ["基隆", "三坑", "八堵", "七堵", "百福", "五堵", "暖暖", "八斗子", "海科館", "四腳亭", "瑞芳", "猴硐", "三貂嶺", "牡丹", "雙溪", "貢寮", "福隆", "汐止", "汐科", "南港", "松山", "臺北", "萬華", "板橋", "浮洲", "樹林", "南樹林", "山佳", "鶯歌"]
let TaoyuanPart = ["桃園", "內壢", "中壢", "埔心", "楊梅", "富岡"]
let HsinchuPart = ["北湖", "湖口", "新豐", "竹北", "千甲", "新莊", "北新竹", "新竹", "三姓橋", "香山"]
let MiaoliPart = ["崎頂", "竹南", "造橋", "豐富", "苗栗", "南勢", "銅鑼", "三義", "談文", "大山", "後龍", "龍港", "白沙屯", "新埔", "通宵", "苑裡"]
let TaichungPart = ["泰安", "后里", "豐原", "粟林", "潭子", "頭家厝", "松竹", "太原", "精武", "臺中", "五權", "大慶", "烏日", "新烏日", "成功", "日南", "大甲", "臺中港", "清水", "沙鹿", "龍井", "大肚", "追分"]
let ChanghuaPart = ["彰化", "花壇", "大村", "員林", "永靖", "社頭", "田中", "二水"]
let NantouPart = ["源泉", "濁水", "龍泉", "集集", "水里", "車埕"]
let YunlinPart = ["林內", "斗六", "石榴", "斗南", "石龜"]
let ChiayiPart = ["大林", "民雄", "嘉北", "嘉義", "水上", "南靖"]
let TainanPart = ["後壁", "新營", "柳營", "隆田", "林鳳營", "拔林", "善化", "南科", "新市", "永康", "臺南", "大橋", "保安", "仁德", "中洲", "長榮大學", "沙崙"]
let KaohsiungPart = ["大湖", "路竹", "岡山", "橋頭", "楠梓", "新左營", "左營", "內惟", "美術館", "鼓山", "三塊厝", "高雄", "民族", "科工館", "正義", "鳳山", "後庄", "九曲堂"]
let PingtungPart = ["六塊厝", "屏東", "歸來", "麟洛", "西勢", "竹田", "潮州", "崁頂", "南州", "鎮安", "林邊", "佳冬", "東海", "枋寮", "加祿", "內獅", "枋山", "枋野"]
let TaitungPart = ["池上", "海端", "關山", "瑞和", "瑞源", "鹿野", "山里", "臺東", "康樂", "知本", "太麻里", "金崙", "瀧溪", "大武", "古莊"]
let HualienPart = ["和平", "和仁", "崇德", "新城（太魯閣）", "景美", "北埔", "花蓮", "花蓮港", "吉安", "志學", "平和", "壽豐", "豐田", "林榮新光", "南平", "鳳林", "萬榮", "光復", "大富", "富源", "瑞穗", "三民", "玉里", "東里", "東竹", "富里"]
let YilanPart = ["大里", "頭城", "礁溪", "四城", "宜蘭", "二結", "羅東", "冬山", "蘇澳新", "蘇澳", "永樂", "東澳", "南澳", "漢本", "石城", "大溪", "龜山", "外澳", "頂埔", "中里", "新馬", "武塔"]
